In [19]:
import pandas as pd
import numpy as np

In [1]:
data = {
    'X':[78,85,96,80,86],
    'Y':[84,94,89,83,86],
    'Z':[86,97,96,72,83]
}
data1 = {
    'Company': ['GOOG' ,'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
    'Person': 'Sam Charlie Amy Venessa Carl Sarah'.split(),
    'Sales' : [200,120,340,124,243,350]
};

In [59]:
data = pd.DataFrame(data)
data1 = pd.DataFrame(data1)

In [7]:
data

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [8]:
def getPowerofElements(element):
    return element**2

In [12]:
data['NewX'] = data['X'].apply(lambda x : getPowerofElements(x))

In [14]:
data['NewY'] = data['Y'].apply(lambda x : getPowerofElements(x))

In [16]:
data['NewZ'] = data['Z'].apply(lambda x : getPowerofElements(x))

In [17]:
data

    X   Y   Z  NewX  NewY  NewZ
0  78  84  86  6084  7056  7396
1  85  94  97  7225  8836  9409
2  96  89  96  9216  7921  9216
3  80  83  72  6400  6889  5184
4  86  86  83  7396  7396  6889

In [20]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [22]:
exam_data = pd.DataFrame(exam_data)

In [25]:
exam_data

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [28]:
exam_data['score'].fillna(exam_data['score'].mean(),inplace=True)

In [29]:
exam_data

        name    score  attempts qualify
0  Anastasia  12.5000         1     yes
1       Dima   9.0000         3      no
2  Katherine  16.5000         2     yes
3      James  13.5625         3      no
4      Emily   9.0000         2      no
5    Michael  20.0000         3     yes
6    Matthew  14.5000         1     yes
7      Laura  13.5625         1      no
8      Kevin   8.0000         2      no
9      Jonas  19.0000         1     yes

In [33]:
exam_data['New'] = len(exam_data['name'])

In [34]:
exam_data

        name    score  attempts qualify  New
0  Anastasia  12.5000         1     yes   10
1       Dima   9.0000         3      no   10
2  Katherine  16.5000         2     yes   10
3      James  13.5625         3      no   10
4      Emily   9.0000         2      no   10
5    Michael  20.0000         3     yes   10
6    Matthew  14.5000         1     yes   10
7      Laura  13.5625         1      no   10
8      Kevin   8.0000         2      no   10
9      Jonas  19.0000         1     yes   10

In [37]:
exam_data[['score','New']].corr()

       score  New
score    1.0  NaN
New      NaN  NaN

In [40]:
exam_data[exam_data['name'].str.contains('A',case=False)]

        name    score  attempts qualify  New
0  Anastasia  12.5000         1     yes   10
1       Dima   9.0000         3      no   10
2  Katherine  16.5000         2     yes   10
3      James  13.5625         3      no   10
5    Michael  20.0000         3     yes   10
6    Matthew  14.5000         1     yes   10
7      Laura  13.5625         1      no   10
9      Jonas  19.0000         1     yes   10

In [46]:
exam_data.drop(exam_data['name']=='Dima')

KeyError: '[False  True False False False False False False False False] not found in axis'

In [51]:
grpBy = exam_data.groupby('qualify')

In [52]:
grpBy

In [53]:
grpBy.count()

         name  score  attempts  New
qualify
no          5      5         5    5
yes         5      5         5    5

In [54]:
grpBy.sum()

          score  attempts  New
qualify
no       53.125        11   50
yes      82.500         8   50

In [60]:
new = pd.concat([data,data1,exam_data],axis=1)

In [61]:
new

,X,Y,Z,Company,Person,Sales,name,score,attempts,qualify,New
0,78.0,84.0,86.0,GOOG,Sam,200.0,Anastasia,12.5000,1,yes,10
1,85.0,94.0,97.0,GOOG,Charlie,120.0,Dima,9.0000,3,no,10
2,96.0,89.0,96.0,MSFT,Amy,340.0,Katherine,16.5000,2,yes,10
3,80.0,83.0,72.0,MSFT,Venessa,124.0,James,13.5625,3,no,10
4,86.0,86.0,83.0,FB,Carl,243.0,Emily,9.0000,2,no,10
5,NaN,NaN,NaN,FB,Sarah,350.0,Michael,20.0000,3,yes,10
6,NaN,NaN,NaN,NaN,NaN,NaN,Matthew,14.5000,1,yes,10
7,NaN,NaN,NaN,NaN,NaN,NaN,Laura,13.5625,1,no,10
8,NaN,NaN,NaN,NaN,NaN,NaN,Kevin,8.0000,2,no,10
9,NaN,NaN,NaN,NaN,NaN,NaN,Jonas,19.0000,1,yes,10

In [68]:
new['Z'].fillna(new['Z'].mean(),inplace=True)

In [71]:
def fillNTSL(x):
    x = 'NETSOL'
    return x

In [73]:
new['Company'].fillna(new['Company'].apply(lambda x : fillNTSL(x)),inplace=True)

In [74]:
new

,X,Y,Z,Company,Person,Sales,name,score,attempts,qualify,New
0,78.0,84.0,86.0,GOOG,Sam,200.0,Anastasia,12.5000,1,yes,10
1,85.0,94.0,97.0,GOOG,Charlie,120.0,Dima,9.0000,3,no,10
2,96.0,89.0,96.0,MSFT,Amy,340.0,Katherine,16.5000,2,yes,10
3,80.0,83.0,72.0,MSFT,Venessa,124.0,James,13.5625,3,no,10
4,86.0,86.0,83.0,FB,Carl,243.0,Emily,9.0000,2,no,10
5,85.0,87.2,86.8,FB,Sarah,350.0,Michael,20.0000,3,yes,10
6,85.0,87.2,86.8,NETSOL,NaN,NaN,Matthew,14.5000,1,yes,10
7,85.0,87.2,86.8,NETSOL,NaN,NaN,Laura,13.5625,1,no,10
8,85.0,87.2,86.8,NETSOL,NaN,NaN,Kevin,8.0000,2,no,10
9,85.0,87.2,86.8,NETSOL,NaN,NaN,Jonas,19.0000,1,yes,10